# -----------------------------
# 🍺 Homebrew Bundle File
# -----------------------------

# --- Core Command Line Tools ---
brew "git"
brew "zsh"
brew "fzf"
brew "gh"            # GitHub CLI
brew "wget"
brew "htop"
brew "jq"            # JSON parser

# --- Developer Tools ---
brew "nvm"
brew "go"
brew "python"
brew "pyenv"
brew "pyenv-virtualenv"
brew "golangci-lint"
brew "pre-commit"
brew "tree"

# --- Zsh Plugins ---
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "romkatv/powerlevel10k/powerlevel10k"

# --- GUI Apps (All Free) ---
cask "iterm2"            # better terminal
cask "rectangle"         # window snapping
cask "dockdoor"          # better dock control
cask "visual-studio-code"
cask "raycast"           # command launcher
cask "google-chrome"
cask "notion"
cask "docker"            # Docker Desktop (free for personal)
brew "meetingbar"        # shows upcoming meetings in menu bar
